docs/evidence/perf/sweep-win-threads-100.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/load.js
        output: -

     scenarios: (100.00%) 2 scenarios, 55 max VUs, 1m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 20s (exec: traffic, gracefulStop: 30s)
              * measure: 50 looping VUs for 45s (exec: traffic, startTime: 25s, gracefulStop: 30s)


Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

running (0m07.0s), 05/55 VUs, 10 complete and 0 interrupted iterations
warmup    [   3% ] 5 VUs    00.5s/20s
measure • [   0% ] waiting  24.5s

running (0m08.0s), 05/55 VUs, 45 complete and 0 interrupted iterations
warmup    [   8% ] 5 VUs    01.5s/20s
measure • [   0% ] waiting  23.5s

running (0m09.0s), 05/55 VUs, 80 complete and 0 interrupted iterations
warmup    [  13% ] 5 VUs    02.5s/20s
measure • [   0% ] waiting  22.5s

running (0m10.0s), 05/55 VUs, 120 complete and 0 interrupted iterations
warmup    [  18% ] 5 VUs    03.5s/20s
measure • [   0% ] waiting  21.5s

running (0m11.0s), 05/55 VUs, 160 complete and 0 interrupted iterations
warmup    [  23% ] 5 VUs    04.5s/20s
measure • [   0% ] waiting  20.5s

running (0m12.0s), 05/55 VUs, 202 complete and 0 interrupted iterations
warmup    [  28% ] 5 VUs    05.5s/20s
measure • [   0% ] waiting  19.5s

running (0m13.0s), 05/55 VUs, 244 complete and 0 interrupted iterations
warmup    [  33% ] 5 VUs    06.5s/20s
measure • [   0% ] waiting  18.5s

running (0m14.0s), 05/55 VUs, 285 complete and 0 interrupted iterations
warmup    [  38% ] 5 VUs    07.5s/20s
measure • [   0% ] waiting  17.5s

running (0m15.0s), 05/55 VUs, 327 complete and 0 interrupted iterations
warmup    [  43% ] 5 VUs    08.5s/20s
measure • [   0% ] waiting  16.5s

running (0m16.0s), 05/55 VUs, 370 complete and 0 interrupted iterations
warmup    [  48% ] 5 VUs    09.5s/20s
measure • [   0% ] waiting  15.5s

running (0m17.0s), 05/55 VUs, 412 complete and 0 interrupted iterations
warmup    [  53% ] 5 VUs    10.5s/20s
measure • [   0% ] waiting  14.5s

running (0m18.0s), 05/55 VUs, 455 complete and 0 interrupted iterations
warmup    [  58% ] 5 VUs    11.5s/20s
measure • [   0% ] waiting  13.5s

running (0m19.0s), 05/55 VUs, 497 complete and 0 interrupted iterations
warmup    [  63% ] 5 VUs    12.5s/20s
measure • [   0% ] waiting  12.5s

running (0m20.0s), 05/55 VUs, 542 complete and 0 interrupted iterations
warmup    [  68% ] 5 VUs    13.5s/20s
measure • [   0% ] waiting  11.5s

running (0m21.0s), 05/55 VUs, 585 complete and 0 interrupted iterations
warmup    [  73% ] 5 VUs    14.5s/20s
measure • [   0% ] waiting  10.5s

running (0m22.0s), 05/55 VUs, 627 complete and 0 interrupted iterations
warmup    [  78% ] 5 VUs    15.5s/20s
measure • [   0% ] waiting  09.5s

running (0m23.0s), 05/55 VUs, 672 complete and 0 interrupted iterations
warmup    [  83% ] 5 VUs    16.5s/20s
measure • [   0% ] waiting  08.5s

running (0m24.0s), 05/55 VUs, 712 complete and 0 interrupted iterations
warmup    [  88% ] 5 VUs    17.5s/20s
measure • [   0% ] waiting  07.5s

running (0m25.0s), 05/55 VUs, 757 complete and 0 interrupted iterations
warmup    [  93% ] 5 VUs    18.5s/20s
measure • [   0% ] waiting  06.5s

running (0m26.0s), 05/55 VUs, 797 complete and 0 interrupted iterations
warmup    [  98% ] 5 VUs    19.5s/20s
measure • [   0% ] waiting  05.5s

running (0m27.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  04.5s

running (0m28.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  03.5s

running (0m29.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  02.5s

running (0m30.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  01.5s

running (0m31.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  00.5s

running (0m32.0s), 50/55 VUs, 926 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   1% ] 50 VUs  00.5s/45s

running (0m33.0s), 50/55 VUs, 1274 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   3% ] 50 VUs  01.5s/45s

running (0m34.0s), 50/55 VUs, 1625 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   6% ] 50 VUs  02.5s/45s

running (0m35.0s), 50/55 VUs, 2001 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   8% ] 50 VUs  03.5s/45s

running (0m36.0s), 50/55 VUs, 2380 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  10% ] 50 VUs  04.5s/45s

running (0m37.0s), 50/55 VUs, 2763 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  12% ] 50 VUs  05.5s/45s

running (0m38.0s), 50/55 VUs, 3126 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  15% ] 50 VUs  06.5s/45s

running (0m39.0s), 50/55 VUs, 3511 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  17% ] 50 VUs  07.5s/45s

running (0m40.0s), 50/55 VUs, 3913 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  19% ] 50 VUs  08.5s/45s

running (0m41.0s), 50/55 VUs, 4334 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  21% ] 50 VUs  09.5s/45s

running (0m42.0s), 50/55 VUs, 4763 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  23% ] 50 VUs  10.5s/45s

running (0m43.0s), 50/55 VUs, 5141 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  26% ] 50 VUs  11.5s/45s

running (0m44.0s), 50/55 VUs, 5559 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  28% ] 50 VUs  12.5s/45s

running (0m45.0s), 50/55 VUs, 6005 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  30% ] 50 VUs  13.5s/45s

running (0m46.0s), 50/55 VUs, 6341 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  32% ] 50 VUs  14.5s/45s

running (0m47.0s), 50/55 VUs, 6791 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  35% ] 50 VUs  15.5s/45s

running (0m48.0s), 50/55 VUs, 7228 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  37% ] 50 VUs  16.5s/45s

running (0m49.0s), 50/55 VUs, 7669 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  39% ] 50 VUs  17.5s/45s

running (0m50.0s), 50/55 VUs, 8119 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  41% ] 50 VUs  18.5s/45s

running (0m51.0s), 50/55 VUs, 8557 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  43% ] 50 VUs  19.5s/45s

running (0m52.0s), 50/55 VUs, 9006 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  46% ] 50 VUs  20.5s/45s

running (0m53.0s), 50/55 VUs, 9458 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  48% ] 50 VUs  21.5s/45s

running (0m54.0s), 50/55 VUs, 9906 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  50% ] 50 VUs  22.5s/45s

running (0m55.0s), 50/55 VUs, 10352 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  52% ] 50 VUs  23.5s/45s

running (0m56.0s), 50/55 VUs, 10795 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  55% ] 50 VUs  24.5s/45s

running (0m57.0s), 50/55 VUs, 11243 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  57% ] 50 VUs  25.5s/45s

running (0m58.0s), 50/55 VUs, 11681 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  59% ] 50 VUs  26.5s/45s

running (0m59.0s), 50/55 VUs, 12125 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  61% ] 50 VUs  27.5s/45s

running (1m00.0s), 50/55 VUs, 12571 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  63% ] 50 VUs  28.5s/45s

running (1m01.0s), 50/55 VUs, 12987 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  66% ] 50 VUs  29.5s/45s

running (1m02.0s), 50/55 VUs, 13428 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  68% ] 50 VUs  30.5s/45s

running (1m03.0s), 50/55 VUs, 13848 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  70% ] 50 VUs  31.5s/45s

running (1m04.0s), 50/55 VUs, 14283 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  72% ] 50 VUs  32.5s/45s

running (1m05.0s), 50/55 VUs, 14701 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  75% ] 50 VUs  33.5s/45s

running (1m06.0s), 50/55 VUs, 15153 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  77% ] 50 VUs  34.5s/45s

running (1m07.0s), 50/55 VUs, 15594 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  79% ] 50 VUs  35.5s/45s

running (1m08.0s), 50/55 VUs, 16045 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  81% ] 50 VUs  36.5s/45s

running (1m09.0s), 50/55 VUs, 16488 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  83% ] 50 VUs  37.5s/45s

running (1m10.0s), 50/55 VUs, 16931 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  86% ] 50 VUs  38.5s/45s

running (1m11.0s), 50/55 VUs, 17372 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  88% ] 50 VUs  39.5s/45s

running (1m12.0s), 50/55 VUs, 17819 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  90% ] 50 VUs  40.5s/45s

running (1m13.0s), 50/55 VUs, 18257 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  92% ] 50 VUs  41.5s/45s

running (1m14.0s), 50/55 VUs, 18707 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  95% ] 50 VUs  42.5s/45s

running (1m15.0s), 50/55 VUs, 19138 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  97% ] 50 VUs  43.5s/45s

running (1m16.0s), 50/55 VUs, 19438 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  99% ] 50 VUs  44.5s/45s


  █ THRESHOLDS 

    checks{phase:measure}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{phase:measure}
    ✓ 'p(95)<500' p(95)=12.16ms

    http_req_failed{phase:measure}
    ✓ 'rate<0.01' rate=0.73%


  █ TOTAL RESULTS 

    checks_total.......: 157504  2057.258622/s
    checks_succeeded...: 100.00% 157504 out of 157504
    checks_failed......: 0.00%   0 out of 157504

    ✓ list 200
    ✓ list 비어있지 않음
    ✓ orders 200
    ✓ orders 인증됨
    ✓ orders 최소 건수
    ✓ order 처리됨

    CUSTOM
    resp_2xx.......................: 78297 1022.686271/s
    resp_409_conflict..............: 555   7.249203/s
    resp_error_coded...............: 555   7.249203/s
    setup_requests.................: 100   1.306163/s

    HTTP
    http_req_duration..............: avg=4.63ms   min=886.85µs med=2.76ms   p(95)=12.25ms  p(99)=26.45ms  max=305.51ms
      { expected_response:true }...: avg=4.6ms    min=886.85µs med=2.74ms   p(95)=12.17ms  p(99)=26.32ms  max=305.51ms
      { phase:measure }............: avg=4.53ms   min=886.85µs med=2.69ms   p(95)=12.16ms  p(99)=25.28ms  max=247.76ms
    http_req_failed................: 0.70% 555 out of 78852
      { phase:measure }............: 0.73% 555 out of 75464
    http_reqs......................: 78852 1029.935474/s

    EXECUTION
    iteration_duration.............: avg=119.47ms min=107.42ms med=113.53ms p(95)=144.12ms p(99)=204.36ms max=499.48ms
    iterations.....................: 19688 257.157328/s
    vus............................: 50    min=0            max=50
    vus_max........................: 55    min=55           max=55

    NETWORK
    data_received..................: 82 MB 1.1 MB/s
    data_sent......................: 17 MB 218 kB/s



running (1m16.6s), 00/55 VUs, 19688 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s